{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.7.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 110, 110, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 110, 110, 1], "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 4700, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 2350, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "loss_weights": null, "sample_weight_mode": null, "weighted_metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of162.bin", "group1-shard2of162.bin", "group1-shard3of162.bin", "group1-shard4of162.bin", "group1-shard5of162.bin", "group1-shard6of162.bin", "group1-shard7of162.bin", "group1-shard8of162.bin", "group1-shard9of162.bin", "group1-shard10of162.bin", "group1-shard11of162.bin", "group1-shard12of162.bin", "group1-shard13of162.bin", "group1-shard14of162.bin", "group1-shard15of162.bin", "group1-shard16of162.bin", "group1-shard17of162.bin", "group1-shard18of162.bin", "group1-shard19of162.bin", "group1-shard20of162.bin", "group1-shard21of162.bin", "group1-shard22of162.bin", "group1-shard23of162.bin", "group1-shard24of162.bin", "group1-shard25of162.bin", "group1-shard26of162.bin", "group1-shard27of162.bin", "group1-shard28of162.bin", "group1-shard29of162.bin", "group1-shard30of162.bin", "group1-shard31of162.bin", "group1-shard32of162.bin", "group1-shard33of162.bin", "group1-shard34of162.bin", "group1-shard35of162.bin", "group1-shard36of162.bin", "group1-shard37of162.bin", "group1-shard38of162.bin", "group1-shard39of162.bin", "group1-shard40of162.bin", "group1-shard41of162.bin", "group1-shard42of162.bin", "group1-shard43of162.bin", "group1-shard44of162.bin", "group1-shard45of162.bin", "group1-shard46of162.bin", "group1-shard47of162.bin", "group1-shard48of162.bin", "group1-shard49of162.bin", "group1-shard50of162.bin", "group1-shard51of162.bin", "group1-shard52of162.bin", "group1-shard53of162.bin", "group1-shard54of162.bin", "group1-shard55of162.bin", "group1-shard56of162.bin", "group1-shard57of162.bin", "group1-shard58of162.bin", "group1-shard59of162.bin", "group1-shard60of162.bin", "group1-shard61of162.bin", "group1-shard62of162.bin", "group1-shard63of162.bin", "group1-shard64of162.bin", "group1-shard65of162.bin", "group1-shard66of162.bin", "group1-shard67of162.bin", "group1-shard68of162.bin", "group1-shard69of162.bin", "group1-shard70of162.bin", "group1-shard71of162.bin", "group1-shard72of162.bin", "group1-shard73of162.bin", "group1-shard74of162.bin", "group1-shard75of162.bin", "group1-shard76of162.bin", "group1-shard77of162.bin", "group1-shard78of162.bin", "group1-shard79of162.bin", "group1-shard80of162.bin", "group1-shard81of162.bin", "group1-shard82of162.bin", "group1-shard83of162.bin", "group1-shard84of162.bin", "group1-shard85of162.bin", "group1-shard86of162.bin", "group1-shard87of162.bin", "group1-shard88of162.bin", "group1-shard89of162.bin", "group1-shard90of162.bin", "group1-shard91of162.bin", "group1-shard92of162.bin", "group1-shard93of162.bin", "group1-shard94of162.bin", "group1-shard95of162.bin", "group1-shard96of162.bin", "group1-shard97of162.bin", "group1-shard98of162.bin", "group1-shard99of162.bin", "group1-shard100of162.bin", "group1-shard101of162.bin", "group1-shard102of162.bin", "group1-shard103of162.bin", "group1-shard104of162.bin", "group1-shard105of162.bin", "group1-shard106of162.bin", "group1-shard107of162.bin", "group1-shard108of162.bin", "group1-shard109of162.bin", "group1-shard110of162.bin", "group1-shard111of162.bin", "group1-shard112of162.bin", "group1-shard113of162.bin", "group1-shard114of162.bin", "group1-shard115of162.bin", "group1-shard116of162.bin", "group1-shard117of162.bin", "group1-shard118of162.bin", "group1-shard119of162.bin", "group1-shard120of162.bin", "group1-shard121of162.bin", "group1-shard122of162.bin", "group1-shard123of162.bin", "group1-shard124of162.bin", "group1-shard125of162.bin", "group1-shard126of162.bin", "group1-shard127of162.bin", "group1-shard128of162.bin", "group1-shard129of162.bin", "group1-shard130of162.bin", "group1-shard131of162.bin", "group1-shard132of162.bin", "group1-shard133of162.bin", "group1-shard134of162.bin", "group1-shard135of162.bin", "group1-shard136of162.bin", "group1-shard137of162.bin", "group1-shard138of162.bin", "group1-shard139of162.bin", "group1-shard140of162.bin", "group1-shard141of162.bin", "group1-shard142of162.bin", "group1-shard143of162.bin", "group1-shard144of162.bin", "group1-shard145of162.bin", "group1-shard146of162.bin", "group1-shard147of162.bin", "group1-shard148of162.bin", "group1-shard149of162.bin", "group1-shard150of162.bin", "group1-shard151of162.bin", "group1-shard152of162.bin", "group1-shard153of162.bin", "group1-shard154of162.bin", "group1-shard155of162.bin", "group1-shard156of162.bin", "group1-shard157of162.bin", "group1-shard158of162.bin", "group1-shard159of162.bin", "group1-shard160of162.bin", "group1-shard161of162.bin", "group1-shard162of162.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [512], "dtype": "float32"}, {"name": "dense/kernel", "shape": [32768, 4700], "dtype": "float32"}, {"name": "dense/bias", "shape": [4700], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [4700, 2350], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [2350], "dtype": "float32"}]}]}